package ru.netology
import java.util.Scanner

fun main() {
    val scanner = Scanner(System.`in`)
    while (true) {
        val time = scanner.nextInt()
        if (time == 4500) {
            break
        } else {
           println("Выдаст " + agoToText(time))
        }
    }
}

fun agoToText (time : Int) : String = when (time){
    in (0..60) -> "был(а) только что"
    in (61 .. 60*60) -> "был(а)" + time/60 + "${minsHoursChecker(time)}  назад"
    in (60*60+1 .. 24*60*60 ) -> "был(а)" + time/60/60 + "${minsHoursChecker(time)}  назад"
    in (24*60*60+1 ..  2*(24*60*60)) -> "был(а) вчера"
    in (2*(24*60*60)+1 ..  3*(24*60*60)) -> "был(а) позавчера"
    else -> "был(а) давно"
}
fun minsHoursChecker (time: Int) : String = when (time) {
    in (60 .. 60+59), in(21*60 .. 21*60+59), in(31*60 .. 31*60+59),
    in (41*60 .. 41*60+59), in(51*60 .. 51*60+59), -> "минуту"
    in (60*2..60*4+59), in (60*22..60*24+59), in (60*32..60*34+59),
    in (60*42..60*44+59), in (60*52..60*54+59) -> "минуты"
    in (60*5..60*9+59), in (60*25..60*29+59), in (60*35..60*39+59), in (60*45..60*49+59),
    in (60*55..60*59+59), in(60*10 .. 60*10+59), in (60*11 .. 60*11+59), in (60*12 .. 60*12+59),
    in (60*13 .. 60*13+59), in (60*14 .. 60*14+59), in (60*20 .. 60*20+59),
    in (60*30 .. 60*30+59), in (60*40 .. 60*40+59), in (60*50 .. 60*50+59), -> "минут"
    //  Здесь я поплыл и скорее всего начал писать что то лишнее (59)
    in (60*60 .. 60*60+59*60), in (60*60*21 .. 60*60*21+59*60) -> "час"
    in (60*60*2 .. 60*60*2+59*60), in (60*60*3 .. 60*60*3+59*60), in (60*60*4 .. 60*60*4+59*60),
    in (60*60*22 .. 60*60*22+59*60), in (60*60*23 .. 60*60*23+59*60), in (60*60*24 .. 60*60*24+59*60) -> "часа"
    in (60*60*5 .. 60*60*20) -> "часов"
    else -> "Свободный слот, не используется"
}